复习：在前面我们已经学习了Pandas基础，第二章我们开始进入数据分析的业务部分，在第二章第一节的内容中，我们学习了数据的清洗，这一部分十分重要，只有数据变得相对干净，我们之后对数据的分析才可以更有力。而这一节，我们要做的是数据重构，数据重构依旧属于数据理解（准备）的范围。

In [2]:
import numpy as np
import pandas as pd

In [3]:
text = pd.read_csv('data/train-left-up.csv')
text.head(3)

,PassengerId,Survived,Pclass,Name
0,1,0,3,"Braund, Mr. Owen Harris"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,"Heikkinen, Miss. Laina"

# 2 第二章：数据重构

## 2.4 数据的合并

**知识点**：数据的合并与链接，pandas的merge和concat函数，DataFrame的join和append方法   
**思考题**:对比merge、join以及concat的方法的不同以及相同。思考一下在任务四和任务五的情况下，为什么都要求使用DataFrame的append方法，如果只要求使用merge或者join可不可以完成任务四和任务五呢？  
**solution**：merge和join都是按行row连接的，append方法实质上是按列column连接，可以通过concat函数实现

### 2.4.1 任务一：将data文件夹里面的所有数据都载入，观察数据的之间的关系  

Solution: 通过观察，四个文件为train.csv的不同部分，四个文件互相不重叠且合并之后就可以组成完成的train.csv文件

In [3]:
text_left_up = pd.read_csv("data/train-left-up.csv")
text_left_down = pd.read_csv("data/train-left-down.csv")
text_right_up = pd.read_csv("data/train-right-up.csv")
text_right_down = pd.read_csv("data/train-right-down.csv")

In [4]:
text_left_up.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 439 entries, 0 to 438
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  439 non-null    int64
 1   Survived     439 non-null    int64
 2   Pclass       439 non-null    int64
 3   Name         439 non-null    object
dtypes: int64(3), object(1)
memory usage: 13.8+ KB

In [5]:
text_left_down.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 452 entries, 0 to 451
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  452 non-null    int64
 1   Survived     452 non-null    int64
 2   Pclass       452 non-null    int64
 3   Name         452 non-null    object
dtypes: int64(3), object(1)
memory usage: 14.2+ KB

In [6]:
text_right_up.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 439 entries, 0 to 438
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       439 non-null    object
 1   Age       352 non-null    float64
 2   SibSp     439 non-null    int64
 3   Parch     439 non-null    int64
 4   Ticket    439 non-null    object
 5   Fare      439 non-null    float64
 6   Cabin     97 non-null     object
 7   Embarked  438 non-null    object
dtypes: float64(2), int64(2), object(4)
memory usage: 27.6+ KB

In [7]:
text_right_down.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 452 entries, 0 to 451
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       452 non-null    object
 1   Age       362 non-null    float64
 2   SibSp     452 non-null    int64
 3   Parch     452 non-null    int64
 4   Ticket    452 non-null    object
 5   Fare      452 non-null    float64
 6   Cabin     107 non-null    object
 7   Embarked  451 non-null    object
dtypes: float64(2), int64(2), object(4)
memory usage: 28.4+ KB

### 2.4.2：任务二：使用concat方法：将数据train-left-up.csv和train-right-up.csv横向合并为一张表，并保存这张表为result_up

In [8]:
#  将多个dataframe沿着轴向进行连接
result_up = pd.concat([text_left_up,text_right_up],axis=1)
result_up.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 439 entries, 0 to 438
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  439 non-null    int64
 1   Survived     439 non-null    int64
 2   Pclass       439 non-null    int64
 3   Name         439 non-null    object
 4   Sex          439 non-null    object
 5   Age          352 non-null    float64
 6   SibSp        439 non-null    int64
 7   Parch        439 non-null    int64
 8   Ticket       439 non-null    object
 9   Fare         439 non-null    float64
 10  Cabin        97 non-null     object
 11  Embarked     438 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 41.3+ KB

### 2.4.3 任务三：使用concat方法：将train-left-down和train-right-down横向合并为一张表，并保存这张表为result_down。然后将上边的result_up和result_down纵向合并为result。

In [9]:
result_down = pd.concat([text_left_down,text_right_down],axis=1)
result = pd.concat([result_up,result_down])
result.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 451
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 90.5+ KB

### 2.4.4 任务四：使用DataFrame自带的方法join方法和append：完成任务二和任务三的任务

In [10]:
result_up = text_left_up.join(text_right_up)
result_down = text_left_down.join(text_right_up)
result = result_up.append(result_down)
result.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

### 2.4.5 任务五：使用Panads的merge方法和DataFrame的append方法：完成任务二和任务三的任务

In [14]:
result_up = pd.merge(text_left_up,text_right_up,left_index=True,right_index=True)
result_down = pd.merge(text_left_down,text_right_down,left_index=True,right_index=True)
result= result_up.append(result_down)
result.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 2.4.6 任务六：完成的数据保存为result.csv

In [20]:
result.to_csv('result.csv')
result.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 2.5 换一种角度看数据

### 2.5.1 任务一：将我们的数据变为Series类型的数据

In [17]:
text = pd.read_csv('result.csv')  #  这个unnamed列是哪里来的？
text.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
unit_result = text.stack()
unit_result.head()

0  Unnamed: 0                           0
   PassengerId                          1
   Survived                             0
   Pclass                               3
   Name           Braund, Mr. Owen Harris
dtype: object

In [19]:
unit_result.to_csv('unit_result.csv')
test = pd.read_csv('unit_result.csv')
test.head()

   Unnamed: 0   Unnamed: 1                        0
0           0   Unnamed: 0                        0
1           0  PassengerId                        1
2           0     Survived                        0
3           0       Pclass                        3
4           0         Name  Braund, Mr. Owen Harris

## 数据聚合与运算

In [19]:
# 载入data文件中的:result.csv
text = pd.read_csv('result.csv')
text.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 2.6 数据运用

### 2.6.1 任务一：通过教材《Python for Data Analysis》P303、Google or anything来学习了解GroupBy机制

心得：groupby的关键函数有两个：groupby和apply函数，一个明确按照怎样的keys来分组，另一个明确分组后的数据如何进行操作

### 2.6.2：任务二：计算泰坦尼克号男性与女性的平均票价

In [9]:
# method 1
means = text.groupby('Sex')['Fare'].mean()
means

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [11]:
# method 2
df = text['Fare'].groupby(text['Sex'])
means = df.mean()
means

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

### 2.4.3：任务三：统计泰坦尼克号中男女的存活人数

In [15]:
# method 3
survived_sex = text['Survived'].groupby(text['Sex']).sum()
survived_sex

Sex
female    233
male      109
Name: Survived, dtype: int64

### 2.4.4：任务四：计算客舱不同等级的存活人数

In [16]:
# method 1
survived_class = text.groupby('Pclass')['Survived'].sum()
survived_class

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [18]:
# method 3
survived_class = text['Survived'].groupby(text['Pclass']).sum()
survived_class

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

【思考】从任务二到任务四中，这些运算可以通过agg()函数来同时计算。并且可以使用rename函数修改列名。你可以按照提示写出这个过程吗？

solution:  
这个思考题涉及数据聚合的知识点，需要用到agg()函数，同时是将多个函数应用到多个不同的columns上，需要用到字典的形式传递给agg函数。  
此外，还涉及到 pandas.DataFrame.rename() 函数

In [24]:
# 例子
text.groupby('Sex').agg({'Age': 'mean','Survived':'count'}).rename(columns={'Age':'平均年纪','Survived':'存活人数'})

             平均年纪  存活人数
Sex
female  27.915709   314
male    30.726645   577

### 2.4.5：任务五：统计在不同等级的票中的不同年龄的船票花费的平均值

In [23]:
# 使用多个keys对数据进行分组
text.groupby(['Pclass','Age'])['Fare'].mean()

Pclass  Age
1       0.92     151.5500
        2.00     151.5500
        4.00      81.8583
        11.00    120.0000
        14.00    120.0000
                   ...
3       61.00      6.2375
        63.00      9.5875
        65.00      7.7500
        70.50      7.7500
        74.00      7.7750
Name: Fare, Length: 182, dtype: float64

### 2.4.6：任务六：将任务二和任务三的数据合并，并保存到sex_fare_survived.csv

In [26]:
result = pd.merge(means,survived_sex,on='Sex')
result

             Fare  Survived
Sex
female  44.479818       233
male    25.523893       109

In [27]:
result.to_csv('sex_fare_survived.csv')

### 2.4.7：任务七：得出不同年龄的总的存活人数，然后找出最多存活人数的对应的年龄，最后计算存活人数最高的存活率（存活人数/总人数）

In [30]:
# 不同年纪的存活人数
survived_age = text.groupby('Age')['Survived'].sum()
survived_age.head()

Age
0.42    1
0.67    1
0.75    2
0.83    2
0.92    1
Name: Survived, dtype: int64

In [33]:
# series.values
# series.max()
# series[] 表示法 是用来索引的
survived_age[survived_age.values == survived_age.max()]

Age
24.0    15
Name: Survived, dtype: int64

In [38]:
# 总存活人数
_sum = text['Survived'].sum()
print('总存活人数：',_sum)
# 最大存活年龄存活率
perc_age = survived_age.max() / _sum
print('最大存活年龄存活率：', perc_age)

总存活人数： 342
最大存活年龄存活率： 0.043859649122807015